//****************************************************************************
// @Module        Schrittmotor-Controller
// @Filename      
// @Project       common
//----------------------------------------------------------------------------
// @Controller    Infineon XE167F
//
// @Compiler      Tasking
//
// 
//
// @Description   This file contains functions and variables 
//                for controlling z-axis.
//
//	Besonderheit: beim Anfahren der Null-Lage wird eine mechanische Lose
//	berücksichtigt so dass definiert weiter in die Null-Lage
//	eingetaucht wird, bevor der Antrieb abbremst und die Null-Lage
//	verlässt (NUll-Punkt gefunden)
//----------------------------------------------------------------------------
// @Date          
//
//****************************************************************************
#ifndef _LPK_H_
#define _LPK_H_
//****************************************************************************
// include files
//****************************************************************************

//****************************************************************************
// @Macros
//****************************************************************************

//****************************************************************************
// @Defines
//****************************************************************************

//****************************************************************************
// @Typedefs
//****************************************************************************


//****************************************************************************
// @Imported Global Variables
//****************************************************************************

//****************************************************************************
// @Global Variables
//****************************************************************************

//****************************************************************************
// @External Prototypes
//****************************************************************************

//****************************************************************************
// Prototypen definitions
//****************************************************************************
extern unsigned short CommandLPK(unsigned short RepeatCmd, unsigned short Adresse, char *sPtr);
extern unsigned short LPK_Send_PCCmd(unsigned short DelayTime, unsigned short Adresse, char *sPtr);
extern unsigned short LPK_ReceiveAnswer_PCCmd(char *sPtr);
extern unsigned short LastLPKCommando(const char *pszCmd);
unsigned short GetLPKConnected(void);
//****************************************************************************
// @Prototypes Of Local Functions
//****************************************************************************

#endif
